import React from "react";
import Carousel from "react-bootstrap/Carousel";
import Image from "react-bootstrap/Image";

export default function Contacts() {
  return (
    <div>
      <Carousel data-bs-theme="dark">
        <Carousel.Item>
          <Image src="maps.jpg" rounded />
          <Carousel.Caption></Carousel.Caption>
          <h3>TeCHNO</h3>
          <p>
            Уявіть собі жваве місто, де життя вирує щосекунди. Саме тут, на
            одній із жвавих вулиць, розташувався магазин електроніки під назвою
            "TeCHNO". З вітрин сяють найновіші гаджети, заманюючи перехожих
            зазирнути всередину. Завітайте до "TeCHNO", і ви поринете у світ, де
            інновації переплітаються з бездоганним сервісом.{" "}
          </p>
        </Carousel.Item>
        <Carousel.Item>
          <Image src="room.jpg" rounded />
          <Carousel.Caption></Carousel.Caption>
          <h3>Асортимент</h3>
          <p>
            У "TeCHNO" ви знайдете широкий асортимент електроніки на будь-який
            смак: від останніх моделей смартфонів та планшетів до потужних
            ноутбуків та телевізорів з неймовірною картинкою. Магазин також
            пропонує широкий вибір аксесуарів, які допоможуть вам максимально
            використовувати можливості ваших гаджетів. "TeCHNO" пишається не
            лише своїм асортиментом, а й бездоганним сервісом.{" "}
          </p>
        </Carousel.Item>
        <Carousel.Item>
          <Image src="man.jpg" rounded />
          <Carousel.Caption></Carousel.Caption>
          <h3>Персонал</h3>
          <p>
            Тут ви можете не лише купити новий телефон, а й оформити його
            гарантійне обслуговування, налаштувати програмне забезпечення або ж
            просто отримати консультацію щодо використання того чи іншого
            пристрою. "TeCHNO" – це місце, де ви завжди можете розраховувати на
            допомогу та підтримку. Персонал магазину завжди радий допомогти вам
            здійснити вдалу покупку та зробити ваше життя трішки кращим за
            допомогою сучасних технологій .
          </p>
        </Carousel.Item>
      </Carousel>
    </div>
  );
}
